#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_dynamodb_table.state_lock: Refreshing state... [id=tf-state-lock-prod]
data.aws_caller_identity.current: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::004351562122:oidc-provider/token.actions.githubusercontent.com]
data.aws_caller_identity.current: Read complete after 1s [id=004351562122]
aws_s3_bucket.state: Refreshing state... [id=tf-state-us-east-1-004351562122-prod]
aws_iam_role.this_repo: Refreshing state... [id=github-oidc-terraform-remote-state]
aws_iam_role.repos["ahead-in-the-cloud"]: Refreshing state... [id=github-oidc-ahead-in-the-cloud]
aws_iam_role.repos["aws-core-infra"]: Refreshing state... [id=github-oidc-aws-core-infra]
aws_s3_bucket_versioning.state: Refreshing state... [id=tf-state-us-east-1-004351562122-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.repos["ahead-in-the-cloud"] will be destroyed
  # (because key ["ahead-in-the-cloud"] is not in for_each map)
  - resource "aws_iam_role" "repos" {
      - arn                   = "arn:aws:iam::004351562122:role/github-oidc-ahead-in-the-cloud" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:mmccarthy404/ahead-in-the-cloud:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::004351562122:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-07-02T21:04:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "github-oidc-ahead-in-the-cloud" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "github-oidc-ahead-in-the-cloud" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-13T02:59:33Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQCA27SGFP74AFFPKX" -> null

      - inline_policy {
          - name   = "github-oidc-ahead-in-the-cloud" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "*"
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.repos["serverless-bio"] will be created
  + resource "aws_iam_role" "repos" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:mmccarthy404/serverless-bio:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::004351562122:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-oidc-serverless-bio"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "github-oidc-serverless-bio"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "*"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*